spec/fixtures/export_file_attachments_content_request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
  <soapenv:Header>
    <bm:userInfo xmlns:bm="urn:soap.bigmachines.com">
      <bm:sessionId>82CAAC6A7EE8DBBE4C30931F3B4A88A6</bm:sessionId>
    </bm:userInfo>
    <bm:category xmlns:bm="urn:soap.bigmachines.com">Commerce</bm:category>
    <bm:xsdInfo xmlns:bm="urn:soap.bigmachines.com">
      <bm:schemaLocation>https://newtempge.bigmachines.com/bmfsweb/newtempge/schema/v1_0/commerce/quotes_process_bmClone_16.xsd</bm:schemaLocation>
    </bm:xsdInfo>
  </soapenv:Header>
  <soapenv:Body>
    <bm:exportFileAttachments xmlns:bm="urn:soap.bigmachines.com" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
      <bm:mode>content</bm:mode>
      <bm:inline/>
      <bm:attachments>
        <bm:attachment>
          <bm:document_number>1</bm:document_number>
          <bm:variable_name>uploadEngineeringTemplate_File</bm:variable_name>
        </bm:attachment>
      </bm:attachments>
      <bm:transaction>
        <bm:process_var_name>quotes_process_bmClone_16</bm:process_var_name>
        <bm:id>34706909</bm:id>
      </bm:transaction>
    </bm:exportFileAttachments>
  </soapenv:Body>
</soapenv:Envelope>